/*
	迷宫课程项目
	张锦睿  2018302100103
	刘硕    2018302100100
	马奔腾  2018302100099 
*/ 
#include <iostream>
#include<conio.h>
using namespace std;
int M(int a[15][15]);      //输出迷宫 
int main()
{
	 int a[15][15]={
	{0,0,0,0,0,0,0,0,0,0,0,0,0,2,0},
	{0,1,1,1,1,1,0,1,1,1,0,0,0,1,0},
	{0,1,0,0,0,0,0,1,0,1,0,1,1,1,0},
	{0,1,0,0,0,1,1,1,0,1,1,1,0,0,0},
	{0,1,1,1,1,1,0,0,0,0,0,1,1,0,0},
	{0,1,0,0,0,1,0,0,0,0,1,0,1,0,0},
	{0,1,0,0,1,1,1,0,1,0,1,0,1,1,0},
	{0,1,1,0,0,0,1,0,1,1,1,0,0,1,0},
	{0,1,0,0,0,0,1,0,0,1,0,0,0,1,0},
	{0,1,0,0,1,1,1,0,0,1,0,1,1,1,0},
	{0,1,1,1,1,0,0,0,0,1,1,1,1,0,0},
	{0,1,0,0,1,1,1,1,0,0,0,1,1,1,0},
	{0,0,0,0,1,0,0,0,0,0,0,1,0,0,0},
	{1,1,1,1,1,0,0,0,0,0,0,1,0,0,0},
	{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
	};
	int i,j;
 	M(a); 
	int x=0,y=13;
	char move;
	
do
{
	move = getch();
	if (move=='d') //右 
	{
		if(a[x][y+1]==0);
			else if(a[x][y+1]==1) 
				a[x][y]=1,
				a[x][y+1]=2,
				x=x,
				y=y+1,
				move='z';
			system("cls");
		M(a);
		}
	else if (move=='w') //上 
		{
			if(a[x-1][y]==0);
				else
					a[x][y]=1,
					a[x-1][y]=2,
					x=x-1,
					y=y,
					move='z';
			system("cls");
		M(a);
		}
	else if (move=='a') //左 
		{
			if(a[x][y-1]==0);
				else
					a[x][y]=1,
					a[x][y-1]=2,
					x=x,
					y=y-1,
					move='z';
			system("cls");
		M(a);
		}
	else if (move=='s') //下 
		{
			if(a[x+1][y]==0);
				else
					a[x][y]=1,
					a[x+1][y]=2,
					x=x+1,
					y=y,
					move='z';		
			system("cls");
		M(a);	
		
		}
	else if (move=='q') //结束 
			{
				cout<<"结束"<<endl; 
				break;
			}
	if(x==13,y==0)
	{
		cout<<"你成功了"<<endl;
	}
 }while(1);

	return 0;
}
int M(int a[15][15])
{
	int i=0,j=0; 
	cout<<"w-上移，a-左移，s-下移，d-右移，q-放弃" <<endl;
	for(;i<15;i++)
 		{   
			cout<<'\n';
 			for(j=0;j<15;j++)
 			if(a[i][j]==0)
 			cout<<"*";
 				else if(a[i][j]==1)
 					cout<<"  ";
		 			else if(a[i][j]==2)
 						cout<<"。";
		};
	return 0;
}
